app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    @posts = Post.all #0 , 1 ...n

INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "primero"], ["content", "contenido del primero"], ["created_at", "2024-09-26 22:49:44.177205"], ["updated_at", "2024-09-26 22:49:44.177205"]]
---
  def create
    @post = Post.new(posts_params)

    if @post.save